"""
会社情報用法人格選択フィールド
"""
LEGALPERSONALITY_CHOICES = (
    ("1","株式会社"),
    ("2","有限会社"),
    ("3","合名会社"),
    ("4","合資会社"),
    ("5","合同会社"),
    ("6","医療法人"),
    ("7","財団法人"),
    ("8","社団法人"),
    ("9","宗教法人"),
    ("10","学校法人"),
    ("11","相互会社"),
    ("12","特定非営利活動法人"),
    ("13","独立行政法人"),
    ("14","地方独立行政法人"),
    ("15","国立研究開発法人"),
    ("99","その他")
)


"""
会社情報用都道府県選択フィールド
"""
PREFECTURES_CHOICES = (
    ("1","北海道"),
    ("2","青森県"),
    ("3","岩手県"),
    ("4","宮城県"),
    ("5","秋田県"),
    ("6","山形県"),
    ("7","福島県"),
    ("8","茨城県"),
    ("9","栃木県"),
    ("10","群馬県"),
    ("11","埼玉県"),
    ("12","千葉県"),
    ("13","東京都"),
    ("14","神奈川県"),
    ("15","新潟県"),
    ("16","富山県"),
    ("17","石川県"),
    ("18","福井県"),
    ("19","山梨県"),
    ("20","長野県"),
    ("21","岐阜県"),
    ("22","静岡県"),
    ("23","愛知県"),
    ("24","三重県"),
    ("25","滋賀県"),
    ("26","京都府"),
    ("27","大阪府"),
    ("28","兵庫県"),
    ("29","奈良県"),
    ("30","和歌山県"),
    ("31","鳥取県"),
    ("32","島根県"),
    ("33","岡山県"),
    ("34","広島県"),
    ("35","山口県"),
    ("36","徳島県"),
    ("37","香川県"),
    ("38","愛媛県"),
    ("39","高知県"),
    ("40","福岡県"),
    ("41","佐賀県"),
    ("42","長崎県"),
    ("43","熊本県"),
    ("44","大分県"),
    ("45","宮崎県"),
    ("46","鹿児島県"),
    ("47","沖縄県")
)
"""
法人格位置の選択肢
"""
LEGALPERSON_POSI_CHOICES = (
    ('1', '前'),
    ('2', '後')
)

"""
法人区分の選択肢
"""
CORPCLASS_CHOICES = (
    ('1', '法人'),
    ('2', '個人')
)

"""
ミドルネームの選択
"""
MIDDLE_CHOICES = (
    ('1','有効'),
    ('2','無効')
)


"""
SMTP通信タイプ
"""
SMTP_CONNECTION_CHOICES = (
    ('1','なし'),
    ('2','STARTTLS'),
    ('3','SSL/TLS')
)

